'''Задание 1
Пользователь вводит с клавиатуры три числа. Необходимо найти сумму чисел, произведение чисел.
Результат  вычислений вывести на экран.'''
a = int(input('Ввведите первое число'))
print('первое число a')
b = int(input('Введите второе число'))
print('Второе число b')
c = int(input('Введите третье число'))
print('Третье число c')
print ('общая сумма чисел', a+b+c)
print ('Общая сумма произведения', a*b*c)
'''Задание 2
Пользователь вводит с клавиатуры три числа. Первое число — зарплата за месяц, 
второе число — сумма месячного платежа по кредиту в банке, 
третье число — задолженность за коммунальные услуги. Необходимо вывести
на экран сумму, которая останется у пользователя после
всех выплат.'''
a = int(input('Зарплата за месяц'))
print ('Зарплата за месяц a')
b = int(input('Сумма месячного кредита'))
print('Сумма месячного кредита b')
c = int(input('Задолженность за коммунальные услуги'))
print('Задолженность за коммунальные услуги с')
print ('Остаток за месяц', a-b-c)
'''Задание 3
Напишите программу, вычисляющую площадь ромба. Пользователь с клавиатуры вводит длину двух его
диагоналей.'''
a = int(input ('Введите длину первой диагонали'))
print ('Длина 1 диагнонали = a')
b = int (input ('Введите длину второй диагонали'))
print ('Длина второй диагонали = b')
print ('Площадь ромба', int  ( a * b ) / 2)
'''Задание 
Выведите на экран надпись To be or not to be на разных
строках. '''
print ('To be\n or not\n to be')
'''Задание 5
Выведите на экран надпись «Life is what happens when
you're busy making other plans» John Lennon на разных
строках.'''
print ('Life is what happens\n when\n you re busy making other plans\n John Lennon')
